Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_adc_ex.h
  ADC_InjOversamplingTypeDef  InjecOversampling; /*!< Specifies the Oversampling parameters.
                                                      Caution: this setting overwrites the previous oversampling
                                                               configuration if oversampling already enabled.
                                                      Note: This parameter can be modified only if there is no
                                                            conversion is ongoing (both ADSTART and JADSTART cleared).*/
} ADC_InjectionConfTypeDef;

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Structure definition of ADC multimode
  * @note   The setting of these parameters by function HAL_ADCEx_MultiModeConfigChannel() is conditioned by ADCs state
  *         (both Master and Slave ADCs).
  *         Both Master and Slave ADCs must be disabled.
  */
typedef struct
{
  uint32_t Mode;              /*!< Configures the ADC to operate in independent or multimode.
                                   This parameter can be a value of @ref ADC_HAL_EC_MULTI_MODE. */
} ADC_MultiModeTypeDef;
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup ADCEx_Exported_Constants ADC Extended Exported Constants
  * @{
  */

/** @defgroup ADC_injected_external_trigger_source ADC group injected trigger source
  * @{
  */
/* ADC group regular trigger sources for all ADC instances */
#define ADC_INJECTED_SOFTWARE_START        (LL_ADC_INJ_TRIG_SOFTWARE)            /*!< ADC group injected conversion
                                           trigger software start */

#define ADC_EXTERNALTRIGINJEC_T1_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM1_TRGO  )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T1_CC4         (LL_ADC_INJ_TRIG_EXT_TIM1_CH4   )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T2_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM2_TRGO  )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T2_CC1         (LL_ADC_INJ_TRIG_EXT_TIM2_CH1   )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T3_CC4         (LL_ADC_INJ_TRIG_EXT_TIM3_CH4   )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T4_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM4_TRGO  )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_EXT_IT15       (LL_ADC_INJ_TRIG_EXT_EXTI_LINE15)    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T8_CC4         (LL_ADC_INJ_TRIG_EXT_TIM8_CH4   )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T1_TRGO2       (LL_ADC_INJ_TRIG_EXT_TIM1_TRGO2 )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T8_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM8_TRGO  )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T8_TRGO2       (LL_ADC_INJ_TRIG_EXT_TIM8_TRGO2 )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T3_CC3         (LL_ADC_INJ_TRIG_EXT_TIM3_CH3   )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T3_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM3_TRGO  )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T3_CC1         (LL_ADC_INJ_TRIG_EXT_TIM3_CH1   )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T6_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM6_TRGO  )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T15_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM15_TRGO )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T2_CC3         (LL_ADC_INJ_TRIG_EXT_TIM2_CH3   )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T9_CC2         (LL_ADC_INJ_TRIG_EXT_TIM9_CH2   )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T13_CC1        (LL_ADC_INJ_TRIG_EXT_TIM13_CH1  )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T14_CC1        (LL_ADC_INJ_TRIG_EXT_TIM14_CH1  )    /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIGINJEC_T12_CC2        (LL_ADC_INJ_TRIG_EXT_TIM12_CH2  )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T18_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM18_TRGO )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T18_CC1        (LL_ADC_INJ_TRIG_EXT_TIM18_CH1  )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T16_CC1        (LL_ADC_INJ_TRIG_EXT_TIM16_CH1  )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_T7_TRGO        (LL_ADC_INJ_TRIG_EXT_TIM7_TRGO  )    /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIGINJEC_LPTIM_OUT      (LL_ADC_INJ_TRIG_EXT_LPTIM_OUT  )    /*Note: This trigger is available only on ADC1/2 instances */

/*Note: On this series, this trigger is available only on ADC3 instances.*/
#define ADC_EXTERNALTRIGINJEC_T8_CC2         (LL_ADC_INJ_TRIG_EXT_TIM8_CH2       )
#define ADC_EXTERNALTRIGINJEC_T4_CC3         (LL_ADC_INJ_TRIG_EXT_TIM4_CH3       )
#define ADC_EXTERNALTRIGINJEC_T4_CC4         (LL_ADC_INJ_TRIG_EXT_TIM4_CH4       )
#define ADC_EXTERNALTRIGINJEC_T1_CC3         (LL_ADC_INJ_TRIG_EXT_TIM1_CH3       )
#define ADC_EXTERNALTRIGINJEC_EXT_IT3        (LL_ADC_INJ_TRIG_EXT_EXTI_LINE3     )
#define ADC_EXTERNALTRIGINJEC_T18_CC4        (LL_ADC_INJ_TRIG_EXT_TIM18_CH4      )
#define ADC_EXTERNALTRIGINJEC_T18_TRGO_ADC3  (LL_ADC_INJ_TRIG_EXT_TIM18_TRGO_ADC3)
#define ADC_EXTERNALTRIGINJEC_T9_CC1         (LL_ADC_INJ_TRIG_EXT_TIM9_CH1       )
#define ADC_EXTERNALTRIGINJEC_T18_CC2        (LL_ADC_INJ_TRIG_EXT_TIM18_CH2      )
#define ADC_EXTERNALTRIGINJEC_T7_TRGO_ADC3   (LL_ADC_INJ_TRIG_EXT_TIM7_TRGO_ADC3 )
#define ADC_EXTERNALTRIGINJEC_LPTIM_OUT_ADC3 (LL_ADC_INJ_TRIG_EXT_LPTIM_OUT_ADC3 )

/**
  * @}
  */

